 //**--------------头文件-------------------------------------------------------
#include "STC8.h"
#include "intrins.h"

#include <stdio.h>
#include <string.h>

#include "userdefine.h"	

//**--------------全局变量-----------------------------------------------------

//**--------------函数申明-----------------------------------------------------

//**--------------函数定义-----------------------------------------------------





unsigned char beep_delay_time_count=0x00;


/**********************************************************************
*函数名称：init_beep
*描述：蜂鸣器
*返回类型：void
*输入形参：void
***********************************************************************/
void init_beep(void)
{
	set_io_mode(PORT1,2,STAND);	//P1.2  双向端口 LED1
	
	BEEP_OFF;   //关闭
}


/**********************************************************************
*函数名称：BEEP_SPEAK
*描述：蜂鸣器
*返回类型：void
*输入形参：void
***********************************************************************/
void BEEP_SPEAK(void)
{
   unsigned int i=0;

   BEEP_ON;
   
   beep_delay_time_count=50;   //利用中断产生延迟效果 20ms

}





