

//**--------------头文件-------------------------------------------------------
#include "STC8.h"
#include "intrins.h"

#include <stdio.h>
#include <string.h>

#include "userdefine.h"	

//**--------------全局变量-----------------------------------------------------

//**--------------函数申明-----------------------------------------------------

//**--------------函数定义-----------------------------------------------------



/******************************************************************************
** 函数名称 : delay_1us
** 输入参数 : 无
** 输出参数 : 无
** 功能描述 : 延时1us
** 全局变量 : 无
** 作    者 : 蔡维凯
** 日    期 : 
** 修    改 : 无
** 版    本 : V0.1
*******************************************************************************/
void delay_1us(void) // 延时1us，因为系统时钟24MHz
{
	unsigned char i;

	i = 6;
	while (--i);
}

/******************************************************************************
** 函数名称 : delay_ms
** 输入参数 : count
** 输出参数 : 无
** 功能描述 : 毫秒延时
** 全局变量 : 无
** 作    者 : 蔡维凯
** 日    期 : 
** 修    改 : 无
** 版    本 : V0.1
*******************************************************************************/
void delay_ms(unsigned int count)
{
	WORD i, j;

	unsigned char k;

	CLRWDT();
	
	for (i = 0; i < count; i++)
	{
    	for (j = 0; j < 1000; j++)
    	{
    		k = 6;
			while(--k);
    	}
   	}
}


void delay_us(unsigned int count)
{
	WORD i, j;

	unsigned char k;

	
	for (i = 0; i < count; i++)
	{
    	for (j = 0; j < 1; j++)
    	{
    		k = 6;
			while(--k);
    	}
   	}
}
