 
//**--------------头文件-------------------------------------------------------
#include "STC8.h"
#include "intrins.h"

#include <stdio.h>
#include <string.h>

#include "userdefine.h"	

//**--------------全局变量-----------------------------------------------------

//**--------------函数申明-----------------------------------------------------

//**--------------函数定义-----------------------------------------------------





/**********************************************************************
*函数名称：init_pwm
*描述：PWM7  P2.7    
*返回类型：void
*输入形参：void
***********************************************************************/
void init_pwm(void)
{

	
	//----------------------------红外载波频率38kHz   
	
	 set_io_mode(PORT2,7,STAND);	//P2.7  双向端口    PWM7   

	 P27 = 0;						//PWM IO口输出 低电平

	 P_SW2 |= EAXFR;

     PWMCKS = 0x00;                             //PWM时钟为系统时钟 24MHZ
     PWMC   = PWM_MAX_DUTY;                     //设置PWM周期为1200个PWM时钟 24MHZ/624=38.5KHz
	  											//PWM7 周期 占空比设置	  默认1:3
     PWM7T1 = 208;                             	//在计数值为208H地方输出低电平
     PWM7T2 = 0;                             	//在计数值为0H地方输出高电平
     PWM7CR |= ENC7O;                           //使能PWM7通道输出
	 PWM7CR |= 0x40;							//输出端口初始电平设为高电平


     P_SW2 &= ~EAXFR;

     PWMCR = 0x00;                               //初始化PWM模块时 禁止状态
	
}

/**********************************************************************
*函数名称：Enable_pwm
*描述：
*返回类型：void
*输入形参：void
***********************************************************************/
void Enable_pwm(void)
{
	P_SW2 |= EAXFR;

	PWM7CR |= ENC7O;
	PWM7CR |= 0x40;							//输出端口初始电平设为高电平

	P_SW2 &= ~EAXFR;

	PWMCR |= 0x80;							 //启动PWM模块
	
}

/**********************************************************************
*函数名称：disable_pwm
*描述：
*返回类型：void
*输入形参：void
***********************************************************************/
void Disable_pwm(void)
{
	P_SW2 |= EAXFR;

	PWM7CR &= ~ENC7O;
	PWM7CR &= ~0x40;				//输出端口初始电平设为低电平

	P_SW2 &= ~EAXFR;

	PWMCR &= ~0x80;					//关闭PWM模块

	set_io_mode(PORT2,7,STAND);	    //P2.7  双向端口    PWM7   

	P27 = 0;					    //PWM IO口输出 低电平

}


